# GetCurrentlyLoadedReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceLoadContext..::..GetCurrentlyLoadedReference Method
ExternalResourceLoadContext Class See Also
---
Returns a copy of the ExternalResourceReference currently in use by the containing element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceReference GetCurrentlyLoadedReference()
```

Visual Basic
---
```text
Public Function GetCurrentlyLoadedReference As ExternalResourceReference
```

Visual C++
---
```text
public:
ExternalResourceReference^ GetCurrentlyLoadedReference()
```

# ### Return Value
A copy of the ExternalResourceReference currently in use by the containing element.
# Remarks
A server may use to wish this information to, for example, tell whether the Revit user was previously using their server or not.
This reference may be nullNothingnullptra null reference (Nothing in Visual Basic) if there is no current value. For example, a newly-created link being loaded for the first time would have no currently-loaded reference.
# See Also
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace